Тест1/src/Documents/РезервЗапчастей/РезервЗапчастей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РезервЗапчастей</name>
  <registerRecords>AccumulationRegister.Резерв</registerRecords>
  <registerRecords>AccumulationRegister.РегистрНакопления1</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>CatalogRef.Доставка</types>
    </type>
  </attributes>
  <attributes>
    <name>Расход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПроверки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоРекв</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КтоПродал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплачено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УжеОплачено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Откат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомуОткат</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Таблица</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>машина</name>
      <type>
        <types>CatalogRef.Машины</types>
      </type>
    </attributes>
    <attributes>
      <name>цена1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест1/src/Documents/РезервЗапчастей/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РегистрНакопления1 Расход
	Движения.РегистрНакопления1.Записывать = Истина;
	Для Каждого ТекСтрокаТаблица Из Таблица Цикл
		Движение = Движения.РегистрНакопления1.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТаблица.Товар;
		Движение.машина = ТекСтрокаТаблица.машина;
		Движение.Цена = ТекСтрокаТаблица.цена1;
		Движение.Колво = ТекСтрокаТаблица.Количество;
	КонецЦикла;

	// регистр Резерв Приход
	Движения.Резерв.Записывать = Истина;
	Для Каждого ТекСтрокаТаблица Из Таблица Цикл
		Движение = Движения.Резерв.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТаблица.Товар;
		Движение.машина = ТекСтрокаТаблица.машина;
		Движение.Цена = ТекСтрокаТаблица.цена1;
		Движение.Колво = ТекСтрокаТаблица.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
